OPENFOAM/2d/constant/RASProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}


RNGkEpsilonCoeffs
{
    Cmu         0.0845;
    C1          1.42;
    C2          1.68;
    C3          0;
    sigmak      0.71942;
    sigmaEps    0.71942;
    eta0        4.38;
    beta        0.012;
}



