OPENFOAM/2d/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}


simulationType  RAS;
RAS
{
    RASModel        RNGkEpsilon; 
    turbulence      on;
    printCoeffs     on;
    lowReCorrection true;
}



