OPENFOAM/2d/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}


dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.012;

boundaryField
{
    
    inlet
    {
        type            fixedValue; 
        value           uniform 0.012;
    }
    
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.012;
        value           uniform 0.012;
    }
    
    
    wall
    {
        type            epsilonWallFunction;
        value           uniform 0.012;
    }
    
    
    frontAndBack
    {
        type            empty;
    }
}



