OPENFOAM/2d/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}


dimensions      [0 2 -2 0 0 0 0];  

internalField   uniform 0.007;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.007;

    }
    
    outlet
    {
        type            inletOutlet;     
        inletValue      uniform 0.007;
        value           uniform 0.007;
    }
    
    wall
    {
        type            kLowReWallFunction; 
        value           uniform 0.007;      
    }
    
    frontAndBack
    {
        type            empty;
    }
}




