OPENFOAM/2d/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}


dimensions      [0 2 -1 0 0 0 0];  

internalField   uniform 1e-5;     

boundaryField
{
    
    inlet
    {
        type            calculated;
	value		uniform 1e-5;
    }
    
    
    outlet
    {
        type            zeroGradient;
    }
    
    wall
    {
        type            nutLowReWallFunction;
	value		uniform 1e-5;
    }
    
    
    frontAndBack
    {
        type            empty;
    }
}

