OPENFOAM/2d/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}



ddtSchemes
{
    default         backward;
}


gradSchemes
{
    default         Gauss linear;
}


divSchemes
{
    
    div(phi,U)          Gauss linear;

    div(phi,k)          Gauss linearUpwind grad(k);
    div(phi,epsilon)    Gauss linearUpwind grad(epsilon);

    div((nuEff*dev2(T(grad(U)))))  Gauss linear;

}


laplacianSchemes
{
    default         Gauss linear corrected;  

}


interpolationSchemes
{
    default         linear;  
}


snGradSchemes
{
    default         corrected;  
}


wallDist
{
    method meshWave;  
}


